local mt = {}

-- bol
-- 获取表
function mt.getTL(item)
    if mt[item] == nil then
        mt[item] = {}
    end
    return mt[item]
end

-- 获取属性颜色
mt.color = {'|cFFFFFFFF', '|cFFFFFF00', '|cFFF1A4E0', '|cFFFF0000'}

mt.white = {
    wq = {{'外功', 1, 100}, {'内功', 1, 100}, {'出招速度', 1, 100}, {'会心加成', 1, 100},
          {'招式', 1, 100}, {'身法', 1, 100}, {'心法', 1, 100}}
}
mt.yellow = {'外功', '内功', '出招速度', '会心加成', '招式', '身法', '心法'}
mt.pink = {'会心率', '吸血率', '眩晕率', '减速率', '沉默率'}
mt.red = {'风相性', '云相性', '火相性', '地相性', '雷相性', '全属性', '多重数', '固定破甲',
          '增伤率', '分裂比例'}

for i, v in ipairs(mt.white) do
    print(mt.white)
end
-- 白属性
mt.wq = {
    white = {'外功', '内功', '出招速度', '会心加成', '招式', '身法', '心法'},
    yellow = {'外功', '内功', '出招速度', '会心加成', '招式', '身法', '心法'},
    pink = {'会心率', '吸血率', '眩晕率', '减速率', '沉默率'},
    red = {'风相性', '云相性', '火相性', '地相性', '雷相性', '全属性', '多重数', '固定破甲',
           '增伤率', '分裂比例'}
}

mt.fj = {
    white = {"护甲", "气血", "内力", "招式", "身法", "心法"},
    yellow = {"护甲", "气血", "内力", "招式", "身法", "心法"},
    pink = {"免疫中毒", "免疫减攻速", "免疫减移速", "免疫破甲", "免疫沉默", "免疫眩晕",
            "免疫闪避", "免疫减攻击"},
    red = {"风相性", "云相性", "火相性", "地相性", "雷相性", "全属性", "固定减伤", "减伤率"}
}

mt.sp = {
    white = {"气血恢复", "内力恢复", "会心率"},
    yellow = {"气血恢复", "内力恢复", "招式", "身法", "心法"},
    pink = {"辉煌光环", "恢复光环", "专注光环", "耐久光环", "吸血光环", "邪恶光环",
            "荆棘光环", "强击光环", "命令光环", "减速光环"},
    red = {"风相性", "云相性", "火相性", "地相性", "雷相性", "全属性", "会心率", "出招间隔"}
}
mt.shoe = {
    white = {"移动速度", "气血", "内力", "招式", "身法", "心法"},
    yellow = {"移动速度", "气血", "内力", "招式", "身法", "心法"},
    pink = {"出招速度", "会心加成", "会心率"},
    red = {"风相性", "云相性", "火相性", "地相性", "雷相性", "全属性", "出招间隔", "固定减伤",
           "减伤率"}
}

return mt
